Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FV08KM202.h
#define _IFS4_HLVDIF_POSITION                    0x00000008
#define _IFS4_HLVDIF_MASK                        0x00000100
#define _IFS4_HLVDIF_LENGTH                      0x00000001

#define _IFS4_CTMUIF_POSITION                    0x0000000D
#define _IFS4_CTMUIF_MASK                        0x00002000
#define _IFS4_CTMUIF_LENGTH                      0x00000001

#define _IFS4_DAC1IF_POSITION                    0x0000000E
#define _IFS4_DAC1IF_MASK                        0x00004000
#define _IFS4_DAC1IF_LENGTH                      0x00000001

#define _IFS4_DAC2IF_POSITION                    0x0000000F
#define _IFS4_DAC2IF_MASK                        0x00008000
#define _IFS4_DAC2IF_LENGTH                      0x00000001

#define _IFS5_ULPWUIF_POSITION                   0x00000000
#define _IFS5_ULPWUIF_MASK                       0x00000001
#define _IFS5_ULPWUIF_LENGTH                     0x00000001

#define _IFS6_CLC1IF_POSITION                    0x00000000
#define _IFS6_CLC1IF_MASK                        0x00000001
#define _IFS6_CLC1IF_LENGTH                      0x00000001

#define _IFS6_CLC2IF_POSITION                    0x00000001
#define _IFS6_CLC2IF_MASK                        0x00000002
#define _IFS6_CLC2IF_LENGTH                      0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_CCP1IE_POSITION                    0x00000001
#define _IEC0_CCP1IE_MASK                        0x00000002
#define _IEC0_CCP1IE_LENGTH                      0x00000001

#define _IEC0_CCP2IE_POSITION                    0x00000002
#define _IEC0_CCP2IE_MASK                        0x00000004
#define _IEC0_CCP2IE_LENGTH                      0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_CCP3IE_POSITION                    0x00000005
#define _IEC0_CCP3IE_MASK                        0x00000020
#define _IEC0_CCP3IE_LENGTH                      0x00000001

#define _IEC0_CCP4IE_POSITION                    0x00000006
#define _IEC0_CCP4IE_MASK                        0x00000040
#define _IEC0_CCP4IE_LENGTH                      0x00000001

#define _IEC0_CCT1IE_POSITION                    0x00000007
#define _IEC0_CCT1IE_MASK                        0x00000080
#define _IEC0_CCT1IE_LENGTH                      0x00000001

#define _IEC0_CCT2IE_POSITION                    0x00000008
#define _IEC0_CCT2IE_MASK                        0x00000100
#define _IEC0_CCT2IE_LENGTH                      0x00000001

#define _IEC0_U1RXIE_POSITION                    0x0000000B
#define _IEC0_U1RXIE_MASK                        0x00000800
#define _IEC0_U1RXIE_LENGTH                      0x00000001

#define _IEC0_U1TXIE_POSITION                    0x0000000C
#define _IEC0_U1TXIE_MASK                        0x00001000
#define _IEC0_U1TXIE_LENGTH                      0x00000001

#define _IEC0_AD1IE_POSITION                     0x0000000D
#define _IEC0_AD1IE_MASK                         0x00002000
#define _IEC0_AD1IE_LENGTH                       0x00000001

#define _IEC0_NVMIE_POSITION                     0x0000000F
#define _IEC0_NVMIE_MASK                         0x00008000
#define _IEC0_NVMIE_LENGTH                       0x00000001

#define _IEC1_SSP1IE_POSITION                    0x00000000
#define _IEC1_SSP1IE_MASK                        0x00000001
#define _IEC1_SSP1IE_LENGTH                      0x00000001

#define _IEC1_BCL1IE_POSITION                    0x00000001
#define _IEC1_BCL1IE_MASK                        0x00000002
#define _IEC1_BCL1IE_LENGTH                      0x00000001

#define _IEC1_CMIE_POSITION                      0x00000002
#define _IEC1_CMIE_MASK                          0x00000004
#define _IEC1_CMIE_LENGTH                        0x00000001

#define _IEC1_CNIE_POSITION                      0x00000003
#define _IEC1_CNIE_MASK                          0x00000008
#define _IEC1_CNIE_LENGTH                        0x00000001

#define _IEC1_INT1IE_POSITION                    0x00000004
#define _IEC1_INT1IE_MASK                        0x00000010
#define _IEC1_INT1IE_LENGTH                      0x00000001

#define _IEC1_CCP5IE_POSITION                    0x00000006
#define _IEC1_CCP5IE_MASK                        0x00000040
#define _IEC1_CCP5IE_LENGTH                      0x00000001

#define _IEC1_CCT3IE_POSITION                    0x0000000B
#define _IEC1_CCT3IE_MASK                        0x00000800
#define _IEC1_CCT3IE_LENGTH                      0x00000001

#define _IEC1_CCT4IE_POSITION                    0x0000000C
#define _IEC1_CCT4IE_MASK                        0x00001000
#define _IEC1_CCT4IE_LENGTH                      0x00000001

#define _IEC1_INT2IE_POSITION                    0x0000000D
#define _IEC1_INT2IE_MASK                        0x00002000
#define _IEC1_INT2IE_LENGTH                      0x00000001

#define _IEC1_U2RXIE_POSITION                    0x0000000E
#define _IEC1_U2RXIE_MASK                        0x00004000
#define _IEC1_U2RXIE_LENGTH                      0x00000001

#define _IEC1_U2TXIE_POSITION                    0x0000000F
#define _IEC1_U2TXIE_MASK                        0x00008000
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC2_CCT5IE_POSITION                    0x00000009
#define _IEC2_CCT5IE_MASK                        0x00000200
#define _IEC2_CCT5IE_LENGTH                      0x00000001

#define _IEC3_SSP2IE_POSITION                    0x00000001
#define _IEC3_SSP2IE_MASK                        0x00000002
#define _IEC3_SSP2IE_LENGTH                      0x00000001

#define _IEC3_BCL2IE_POSITION                    0x00000002
#define _IEC3_BCL2IE_MASK                        0x00000004
#define _IEC3_BCL2IE_LENGTH                      0x00000001

#define _IEC3_RTCIE_POSITION                     0x0000000E
#define _IEC3_RTCIE_MASK                         0x00004000
#define _IEC3_RTCIE_LENGTH                       0x00000001

#define _IEC4_U1ERIE_POSITION                    0x00000001
#define _IEC4_U1ERIE_MASK                        0x00000002
#define _IEC4_U1ERIE_LENGTH                      0x00000001

#define _IEC4_U2ERIE_POSITION                    0x00000002
#define _IEC4_U2ERIE_MASK                        0x00000004
#define _IEC4_U2ERIE_LENGTH                      0x00000001

#define _IEC4_HLVDIE_POSITION                    0x00000008
#define _IEC4_HLVDIE_MASK                        0x00000100
#define _IEC4_HLVDIE_LENGTH                      0x00000001

#define _IEC4_CTMUIE_POSITION                    0x0000000D
#define _IEC4_CTMUIE_MASK                        0x00002000
#define _IEC4_CTMUIE_LENGTH                      0x00000001

#define _IEC4_DAC1IE_POSITION                    0x0000000E
#define _IEC4_DAC1IE_MASK                        0x00004000
#define _IEC4_DAC1IE_LENGTH                      0x00000001

#define _IEC4_DAC2IE_POSITION                    0x0000000F
#define _IEC4_DAC2IE_MASK                        0x00008000
#define _IEC4_DAC2IE_LENGTH                      0x00000001

#define _IEC5_ULPWUIE_POSITION                   0x00000000
#define _IEC5_ULPWUIE_MASK                       0x00000001
#define _IEC5_ULPWUIE_LENGTH                     0x00000001

#define _IEC6_CLC1IE_POSITION                    0x00000000
#define _IEC6_CLC1IE_MASK                        0x00000001
#define _IEC6_CLC1IE_LENGTH                      0x00000001

#define _IEC6_CLC2IE_POSITION                    0x00000001
#define _IEC6_CLC2IE_MASK                        0x00000002
#define _IEC6_CLC2IE_LENGTH                      0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_CCP1IP_POSITION                    0x00000004
#define _IPC0_CCP1IP_MASK                        0x00000070
#define _IPC0_CCP1IP_LENGTH                      0x00000003

#define _IPC0_CCP2IP_POSITION                    0x00000008
#define _IPC0_CCP2IP_MASK                        0x00000700
#define _IPC0_CCP2IP_LENGTH                      0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

