Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FV08KM202.h
#define _CCP5CON1L_CLKSEL0_POSITION              0x00000008
#define _CCP5CON1L_CLKSEL0_MASK                  0x00000100
#define _CCP5CON1L_CLKSEL0_LENGTH                0x00000001

#define _CCP5CON1L_CLKSEL1_POSITION              0x00000009
#define _CCP5CON1L_CLKSEL1_MASK                  0x00000200
#define _CCP5CON1L_CLKSEL1_LENGTH                0x00000001

#define _CCP5CON1L_CLKSEL2_POSITION              0x0000000A
#define _CCP5CON1L_CLKSEL2_MASK                  0x00000400
#define _CCP5CON1L_CLKSEL2_LENGTH                0x00000001

#define _CCP5CON1L_CCPMOD_POSITION               0x00000000
#define _CCP5CON1L_CCPMOD_MASK                   0x0000000F
#define _CCP5CON1L_CCPMOD_LENGTH                 0x00000004

#define _CCP5CON1L_CCPMOD0_POSITION              0x00000000
#define _CCP5CON1L_CCPMOD0_MASK                  0x00000001
#define _CCP5CON1L_CCPMOD0_LENGTH                0x00000001

#define _CCP5CON1L_CCPMOD1_POSITION              0x00000001
#define _CCP5CON1L_CCPMOD1_MASK                  0x00000002
#define _CCP5CON1L_CCPMOD1_LENGTH                0x00000001

#define _CCP5CON1L_CCPMOD2_POSITION              0x00000002
#define _CCP5CON1L_CCPMOD2_MASK                  0x00000004
#define _CCP5CON1L_CCPMOD2_LENGTH                0x00000001

#define _CCP5CON1L_CCPMOD3_POSITION              0x00000003
#define _CCP5CON1L_CCPMOD3_MASK                  0x00000008
#define _CCP5CON1L_CCPMOD3_LENGTH                0x00000001

#define _CCP5CON1H_SYNC_POSITION                 0x00000000
#define _CCP5CON1H_SYNC_MASK                     0x0000001F
#define _CCP5CON1H_SYNC_LENGTH                   0x00000005

#define _CCP5CON1H_ALTSYNC_POSITION              0x00000005
#define _CCP5CON1H_ALTSYNC_MASK                  0x00000020
#define _CCP5CON1H_ALTSYNC_LENGTH                0x00000001

#define _CCP5CON1H_ONESHOT_POSITION              0x00000006
#define _CCP5CON1H_ONESHOT_MASK                  0x00000040
#define _CCP5CON1H_ONESHOT_LENGTH                0x00000001

#define _CCP5CON1H_TRIGEN_POSITION               0x00000007
#define _CCP5CON1H_TRIGEN_MASK                   0x00000080
#define _CCP5CON1H_TRIGEN_LENGTH                 0x00000001

#define _CCP5CON1H_OPS_POSITION                  0x00000008
#define _CCP5CON1H_OPS_MASK                      0x00000F00
#define _CCP5CON1H_OPS_LENGTH                    0x00000004

#define _CCP5CON1H_RTRGEN_POSITION               0x0000000E
#define _CCP5CON1H_RTRGEN_MASK                   0x00004000
#define _CCP5CON1H_RTRGEN_LENGTH                 0x00000001

#define _CCP5CON1H_OPSSRC_POSITION               0x0000000F
#define _CCP5CON1H_OPSSRC_MASK                   0x00008000
#define _CCP5CON1H_OPSSRC_LENGTH                 0x00000001

#define _CCP5CON1H_SYNC0_POSITION                0x00000000
#define _CCP5CON1H_SYNC0_MASK                    0x00000001
#define _CCP5CON1H_SYNC0_LENGTH                  0x00000001

#define _CCP5CON1H_SYNC1_POSITION                0x00000001
#define _CCP5CON1H_SYNC1_MASK                    0x00000002
#define _CCP5CON1H_SYNC1_LENGTH                  0x00000001

#define _CCP5CON1H_SYNC2_POSITION                0x00000002
#define _CCP5CON1H_SYNC2_MASK                    0x00000004
#define _CCP5CON1H_SYNC2_LENGTH                  0x00000001

#define _CCP5CON1H_SYNC3_POSITION                0x00000003
#define _CCP5CON1H_SYNC3_MASK                    0x00000008
#define _CCP5CON1H_SYNC3_LENGTH                  0x00000001

#define _CCP5CON1H_SYNC4_POSITION                0x00000004
#define _CCP5CON1H_SYNC4_MASK                    0x00000010
#define _CCP5CON1H_SYNC4_LENGTH                  0x00000001

#define _CCP5CON1H_OPS0_POSITION                 0x00000008
#define _CCP5CON1H_OPS0_MASK                     0x00000100
#define _CCP5CON1H_OPS0_LENGTH                   0x00000001

#define _CCP5CON1H_OPS1_POSITION                 0x00000009
#define _CCP5CON1H_OPS1_MASK                     0x00000200
#define _CCP5CON1H_OPS1_LENGTH                   0x00000001

#define _CCP5CON1H_OPS2_POSITION                 0x0000000A
#define _CCP5CON1H_OPS2_MASK                     0x00000400
#define _CCP5CON1H_OPS2_LENGTH                   0x00000001

#define _CCP5CON1H_OPS3_POSITION                 0x0000000B
#define _CCP5CON1H_OPS3_MASK                     0x00000800
#define _CCP5CON1H_OPS3_LENGTH                   0x00000001

#define _CCP5CON1H_OPSRC_POSITION                0x0000000F
#define _CCP5CON1H_OPSRC_MASK                    0x00008000
#define _CCP5CON1H_OPSRC_LENGTH                  0x00000001

#define _CCP5CON1H_IOPS_POSITION                 0x00000008
#define _CCP5CON1H_IOPS_MASK                     0x00000F00
#define _CCP5CON1H_IOPS_LENGTH                   0x00000004

#define _CCP5CON1H_IOPS0_POSITION                0x00000008
#define _CCP5CON1H_IOPS0_MASK                    0x00000100
#define _CCP5CON1H_IOPS0_LENGTH                  0x00000001

#define _CCP5CON1H_IOPS1_POSITION                0x00000009
#define _CCP5CON1H_IOPS1_MASK                    0x00000200
#define _CCP5CON1H_IOPS1_LENGTH                  0x00000001

#define _CCP5CON1H_IOPS2_POSITION                0x0000000A
#define _CCP5CON1H_IOPS2_MASK                    0x00000400
#define _CCP5CON1H_IOPS2_LENGTH                  0x00000001

#define _CCP5CON1H_IOPS3_POSITION                0x0000000B
#define _CCP5CON1H_IOPS3_MASK                    0x00000800
#define _CCP5CON1H_IOPS3_LENGTH                  0x00000001

#define _CCP5CON2L_ASDG_POSITION                 0x00000000
#define _CCP5CON2L_ASDG_MASK                     0x000000FF
#define _CCP5CON2L_ASDG_LENGTH                   0x00000008

#define _CCP5CON2L_SSDG_POSITION                 0x0000000C
#define _CCP5CON2L_SSDG_MASK                     0x00001000
#define _CCP5CON2L_SSDG_LENGTH                   0x00000001

#define _CCP5CON2L_ASDGM_POSITION                0x0000000E
#define _CCP5CON2L_ASDGM_MASK                    0x00004000
#define _CCP5CON2L_ASDGM_LENGTH                  0x00000001

#define _CCP5CON2L_PWMRSEN_POSITION              0x0000000F
#define _CCP5CON2L_PWMRSEN_MASK                  0x00008000
#define _CCP5CON2L_PWMRSEN_LENGTH                0x00000001

